; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared4 - mode
	infrared7 - mode
	image2 - mode
	spectrograph1 - mode
	image5 - mode
	infrared6 - mode
	image3 - mode
	infrared0 - mode
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared7)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 infrared6)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 image3)
	(supports instrument2 infrared6)
	(supports instrument2 image2)
	(calibration_target instrument2 Star4)
	(supports instrument3 image5)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared4)
	(supports instrument4 spectrograph1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument5 infrared7)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image2)
	(supports instrument6 infrared7)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image5)
	(supports instrument7 image3)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument8 image3)
	(supports instrument8 infrared7)
	(supports instrument8 infrared4)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 infrared7)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared6)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 image2)
	(supports instrument10 spectrograph1)
	(supports instrument10 infrared6)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 GroundStation1)
	(have_image Planet5 infrared4)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon6 spectrograph1)
	(have_image Phenomenon7 infrared7)
	(have_image Phenomenon8 image2)
	(have_image Star9 spectrograph1)
	(have_image Star9 image5)
	(have_image Star10 infrared7)
	(have_image Star10 image5)
	(have_image Star11 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star2)
   goals met: 0 of 12
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite1 star9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star9)
   goals met: 0 of 12
5. (take_image satellite1 star9 instrument4 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 1 of 12
6. (turn_to satellite1 star11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star11)
   goals met: 1 of 12
7. (take_image satellite1 star11 instrument4 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 2 of 12
8. (turn_to satellite1 planet5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet5)
   goals met: 2 of 12
9. (take_image satellite1 planet5 instrument4 infrared4)
   added: (have_image planet5 infrared4)
   goals met: 3 of 12
10. (turn_to satellite1 phenomenon8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 12
11. (take_image satellite1 phenomenon8 instrument4 image2)
   added: (have_image phenomenon8 image2)
   goals met: 4 of 12
12. (turn_to satellite1 groundstation1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation1)
   goals met: 5 of 12
13. (turn_to satellite0 star2 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star2)
   goals met: 5 of 12
14. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 5 of 12
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 12
16. (calibrate satellite2 instrument7 star4)
   added: (calibrated instrument7)
   goals met: 5 of 12
17. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 5 of 12
18. (turn_to satellite0 phenomenon6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 12
19. (take_image satellite0 phenomenon6 instrument0 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 6 of 12
20. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 7 of 12
21. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 7 of 12
22. (take_image satellite0 phenomenon7 instrument0 infrared7)
   added: (have_image phenomenon7 infrared7)
   goals met: 8 of 12
23. (turn_to satellite0 star10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star10)
   goals met: 8 of 12
24. (take_image satellite0 star10 instrument0 infrared7)
   added: (have_image star10 infrared7)
   goals met: 9 of 12
25. (turn_to satellite0 star4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star4)
   goals met: 10 of 12
26. (turn_to satellite2 star10 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star10)
   goals met: 10 of 12
27. (take_image satellite2 star10 instrument7 image5)
   added: (have_image star10 image5)
   goals met: 11 of 12
28. (turn_to satellite2 star9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star9)
   goals met: 11 of 12
29. (take_image satellite2 star9 instrument7 image5)
   added: (have_image star9 image5)
   goals met: 12 of 12
